\u6210\u529F = Succeed
\u5931\u8D25 = Fail
\u9A8C\u8BC1\u7801\u5DF2\u8FC7\u671F = Verification code is expired.
\u9A8C\u8BC1\u7801\u9519\u8BEF = Incorrect verification code.
redis\u7CFB\u7EDF\u9519\u8BEF = Redis system error
redis\u6570\u636E\u8FDE\u63A5\u5931\u8D25 = Redis data connection failure
redis\u6D41\u6C34\u7EBF\u6267\u884C\u9519\u8BEF = Redis pipeline execution error
sql\u6267\u884C\u9519\u8BEF = Sql execution error
\u552F\u4E00\u952E\u51B2\u7A81 = Unique key conflict
\u6570\u636E\u8BBF\u95EE\u9519\u8BEF = Data access error
mongo\u6267\u884C\u9519\u8BEF = Mongo execution error
RSA\u89E3\u5BC6\u9519\u8BEF = RSA decryption error
\u7CFB\u7EDF\u9519\u8BEF = System error
\u60A8\u9700\u8981\u767B\u5F55 = You need to login
\u9A8C\u8BC1\u7801\u8F93\u5165\u9519\u8BEF\u6216\u5DF2\u8FC7\u671F\uFF0C\u8BF7\u91CD\u8BD5\uFF01 = Verification code is incorrect or expired. Please try again\uFF01
vip\u901A\u9053\u5F00\u542F\u4E86 = VIP channel is open.
\u5E94\u7528\u7F16\u7801\u4E0D\u80FD\u662F\u7A7A = App code cannot be null.
\u627E\u4E0D\u5230\u5E94\u7528 = App not found
\u627E\u4E0D\u5230\u7528\u6237 = User not found
\u7EDF\u4E00\u767B\u5F55 = SUL
\u975E\u6CD5code = Invalid code
\u7BA1\u7406\u5458\u4E0D\u5141\u8BB8\u767B\u5F55 = Administrator login not allowed
\u767B\u5F55\u8D26\u6237{} = Login account {}
loginCode\u548CoauthToken\u4E0D\u80FD\u540C\u65F6\u4E3A\u7A7A = LoginCode and oauthToken cannot both be null.
\u975E\u6CD5\u7684loginCode = Invalid loginCode
\u975E\u6CD5\u7684oauthToken = Invalid oauthToken
\u7528\u6237\u540D\u6216\u5BC6\u7801\u9519\u8BEF = The user name or password is incorrect.
\u8D26\u6237\u5DF2\u88AB\u9501\u5B9A = The account has been locked.
\u9A8C\u8BC1\u5DF2\u8FC7\u671F\uFF0C\u8BF7\u91CD\u65B0\u64CD\u4F5C = Verification expired. Please operate again.
\u7528\u6237\u6570\u636E\u6709\u8BEF = Incorrect user data
\u8BE5\u7528\u6237\u5DF2\u4E0D\u662F\u7B2C\u4E00\u6B21\u767B\u5F55\uFF0C\u8BF7\u6838\u5BF9 = The user is not in first login.Please check.
\u5BC6\u7801\u5305\u542B\u975E\u6CD5\u5B57\u7B26 = Invalid characters in password
\u627E\u4E0D\u5230\u8BE5\u79DF\u6237 = Tenant not found
\u5BC6\u7801\u9700\u8981\u5927\u4E8E5\u4F4D = Password contains more than 6 characters.
\u60A8\u7684\u79DF\u6237\u5DF2\u88AB\u51BB\u7ED3 = Your tenant has been suspended.
\u5B58\u5728\u591A\u4E2A\u79DF\u6237\uFF0C\u8BF7\u6838\u5BF9 = There are multiple tenants. Please check.
\u679A\u4E3E\u7C7B\u578B\u6709\u8BEF = Incorrect enumeration type
\u60A8\u8F93\u5165\u7684\u624B\u673A\u53F7\u4E0D\u5B58\u5728 = Your phone number doesn't exist.
\u60A8\u8F93\u5165\u7684\u90AE\u7BB1\u53F7\u4E0D\u5B58\u5728 = Your email doesn't exist.
\u8BF7\u8F93\u5165\u6B63\u786E\u7684\u624B\u673A\u53F7 = Please enter valid phone number.
\u8BF7\u8F93\u5165\u6B63\u786E\u7684\u90AE\u7BB1 = Please enter valid email.
\u627E\u4E0D\u5230freshToken = FreshToken not found
token\u8D85\u65F6 = Token timeout
\u5F02\u5E38 = Exception
\u53EA\u80FD\u79DF\u6237\u7528\u6237\u624D\u80FD\u5207\u6362\u79DF\u6237 = Only tenant users can switch tenants.
\u975E\u6CD5\u7684\u79DF\u6237\uFF01 = Invalid tenant!
\u9A8C\u8BC1\u5DF2\u8FC7\u671F\uFF0C\u8BF7\u91CD\u65B0\u53D1\u9001 = Verification expired. Please send again.
\u60A8\u8F93\u5165\u7684\u624B\u673A\u53F7\u6216\u90AE\u7BB1\u4E0D\u5B58\u5728 = Your phone number or email doesn't exist.
\u65B0\u5BC6\u7801\u4E0D\u80FD\u4E0E\u65E7\u5BC6\u7801\u4E00\u81F4 = The new password cannot be the same as the current password.
\u539F\u5BC6\u7801\u4E0D\u6B63\u786E = The original password is incorrect.
\u7528\u6237\u672A\u627E\u5230 = User not found
\u4FEE\u6539\u5931\u8D25 = Change failed
\u672A\u627E\u5230\u6539[\u8BE5]\u79DF\u6237 = The tenant not found
\u8BF7\u524D\u5F80\u5FAE\u4FE1\u516C\u4F17\u5E73\u53F0\u914D\u7F6E\u6D88\u606F\u52A0\u5BC6\u65B9\u5F0F\u4E3A\u5B89\u5168\u6A21\u5F0F = Please go to WeChat Official Accounts Platform and configure message encryption method as safe mode.
\u6D88\u606F\u6765\u6E90\u975E\u5FAE\u4FE1\u670D\u52A1\u5668 = Message source comes from non-WeChat server.
\u8BF7\u524D\u5F80\u5FAE\u4FE1\u516C\u4F17\u5E73\u53F0\u914D\u7F6E\u6D88\u606F\u52A0\u5BC6\u65B9\u5F0F\u4E3A\u660E\u6587\u6A21\u5F0F = Please go to WeChat Official Accounts Platform and configure message encryption method as plaintext mode.
\u4E8C\u7EF4\u7801\u8FC7\u671F = QR code is expired.
\u8BF7\u91CD\u65B0\u626B\u7801\u5173\u6CE8 = Please scan the QR code again to follow us.
\u8BE5\u624B\u673A\u53F7\u7684\u7528\u6237\u4E0D\u5B58\u5728 = The user of this phone number doesn't exist.
\u60A8\u6CA1\u6709\u767B\u5F55\u8BE5\u7CFB\u7EDF\u7684\u6743\u9650 = You don't have the permission to login the system.
\u4E8C\u7EF4\u7801\u8FC7\u671F\uFF0C\u8BF7\u5237\u65B0\u4E8C\u7EF4\u7801 = QR code is expired. Please refresh it.
\u8BF7\u8F93\u5165\u624B\u673A\u53F7 = Please enter phone number.
\u7ED1\u5B9A\u5931\u8D25\u8BF7\u91CD\u8BD5 = Bind failed. Please try again.
\u4E8C\u7EF4\u7801\u8FC7\u671F\u89E3\u5BC6\u524D\uFF1A{}\u89E3\u5BC6\u540E\uFF1A{} = QR code is expired.  Before decryption: {}   After decryption: {}
\u8BF7\u626B\u7801\u5173\u6CE8 = Please scan the QR code to follow us.
iam\u4E0D\u5B58\u5728\u8BE5\u5E94\u7528 = No such app in iam
\u8BE5\u79DF\u6237\u6CA1\u6709\u6B64\u5E94\u7528\u7684\u6743\u9650 = The tenant doesn't have the permission to the app.
\u4E8C\u7EF4\u7801\u8FC7\u671F\uFF0C\u8BF7\u5237\u65B0\u9875\u9762 = QR code is expired. Please refresh the page.
\u8BE5\u5E94\u7528\u4E0D\u5B58\u5728\uFF1A{} = The app doesn't exist: {}
\u60A8\u6CA1\u6709\u767B\u5F55\u8BE5\u5E94\u7528\u7684\u6743\u9650 = You don't have the permission to login the app.
\u793E\u4F1A\u5316\u8EAB\u4EFD\u6E90\u552F\u4E00\u6807\u8BC6\u4E0D\u6B63\u786E\u6216\u672A\u914D\u7F6E = Incorrect or unconfigured social IdP
\u5E94\u7528\u88AB\u505C\u7528\u6216\u672A\u5F00\u542F\u5FAE\u4FE1\u516C\u4F17\u53F7\u626B\u7801\u767B\u5F55 = The app may be suspended or QR code login is not enabled.
\u5BC6\u7801\u4E0D\u6B63\u786E = Incorrect password
\u60A8\u6240\u767B\u5F55\u7684\u8D26\u6237\u5DF2\u88AB\u9501\u5B9A\uFF0C\u8BF7\u8054\u7CFB\u7BA1\u7406\u5458 = The account you login has been locked. Please contact the Administrator.
\u7528\u6237\u88AB\u505C\u7528 = The user is disabled.
\u672A\u8FC7\u671F = Not expired
\u5DF2\u8FC7\u671F = Expired
\u6C38\u4E0D\u8FC7\u671F = Never expire
\u65E0\u914D\u7F6E = No configuration
\u89E3\u6790\u6570\u636E\u5931\u8D25 = Parse data failed
\u7B7E\u540D\u9A8C\u8BC1\u9519\u8BEF = Signature verification error
xml\u89E3\u6790\u5931\u8D25 = Xml parsing failed
sha\u52A0\u5BC6\u751F\u6210\u7B7E\u540D\u5931\u8D25 = Sha generate cryptographic signature failed
SymmetricKey\u975E\u6CD5 = Invalid SymmetricKey
appid\u6821\u9A8C\u5931\u8D25 = Appid validation failed
aes\u52A0\u5BC6\u5931\u8D25 = Aes encryption failed
aes\u89E3\u5BC6\u5931\u8D25 = Aes parsing failed
\u89E3\u5BC6\u540E\u5F97\u5230\u7684buffer\u975E\u6CD5 = Invalid buffer after decrytion
{}\u4E3A\u5FC5\u586B\u9879 = {} must not null
\u9A8C\u8BC1\u7801\u6821\u9A8C\u9519\u8BEF\uFF0C\u8BF7\u91CD\u8BD5 = Wrong verification code. Please try again.
\u5BC6\u7801\u9700\u8981\u5927\u4E8E{}\u4F4D = The password should be more than {} characters.
\u5BC6\u7801\u9700\u8981\u5927\u4E8E6\u4F4D = The password should be more than 6 characters.
\u7B2C{}\u6B21\u8F93\u5165\u9519\u8BEF\uFF0C\u5269\u4F59{}\u6B21\uFF0C\u8BF7\u8F93\u5165\u6B63\u786E\u7684\u7528\u6237\u540D\u6216\u5BC6\u7801\uFF01= The {} time you entered it incorrectly, there are {} times left
\u7B2C1\u6B21\u8F93\u5165\u9519\u8BEF\uFF0C\u5269\u4F59{}\u6B21\uFF0C\u8BF7\u8F93\u5165\u6B63\u786E\u7684\u7528\u6237\u540D\u6216\u5BC6\u7801\uFF01 = You entered 1 time wrong password. You have {} times left
\u9519\u8BEF\u5BC6\u7801\u8F93\u5165\u6B21\u6570\u8FC7\u591A\uFF0C\u8BF7\u7A0D\u540E\u518D\u8BD5\u3002 = You tried to sign too many times. Please try again later
\u7B2C1\u6B21\u8F93\u5165\u9519\u8BEF\uFF0C\u5269\u4F590\u6B21\uFF0C\u8D26\u53F7\u5DF2\u88AB\u9501\u5B9A\uFF0C\u8BF7{}\u5206\u949F\u540E\u518D\u8BD5\uFF01 = You entered 1 times wrong  password. Please try again after {} minutes!
\u60A8\u5DF2\u8FDE\u7EED{}\u6B21\u8F93\u5165\u9519\u8BEF\uFF0C\u8D26\u53F7\u5DF2\u88AB\u9501\u5B9A\uFF0C\u8BF7{}\u5206\u949F\u540E\u518D\u8BD5\uFF01 = You entered {} times wrong password. Please try again after {} minutes!
\u5E10\u6237\u9891\u7E41\u767B\u5F55\u5931\u8D25\uFF0C\u5DF2\u88AB\u9501\u5B9A5\u5206\u949F\uFF01 = The account failed to log in frequently and has been locked for 5 minutes!
\u5BC6\u7801\u5FC5\u987B\u5305\u542B\u5927\u5C0F\u5199\u5B57\u6BCD\u3001\u6570\u5B57\u548C\u7279\u6B8A\u5B57\u7B26\u4E2D\u76843\u79CD\u7C7B\u578B\uFF0C\u957F\u5EA6\u4E0D\u5C0F\u4E8E{}\u4F4D = password must contain three types of upper and lower case letters, numbers\uFF0Cspecial characters, and length shall not be less than {} digits
\u5BC6\u7801\u5FC5\u987B\u5305\u542B\u5927\u5C0F\u5199\u5B57\u6BCD\u3001\u6570\u5B57\u548C\u7279\u6B8A\u5B57\u7B26\u4E2D\u76844\u79CD\u7C7B\u578B\uFF0C\u957F\u5EA6\u4E0D\u5C0F\u4E8E{}\u4F4D = password must contain  upper and lower case letters, numbers ,special characters, and length shall not be less than {} digits
\u5BC6\u7801\u5FC5\u987B\u5305\u542B\u5927\u5C0F\u5199\u5B57\u6BCD\u3001\u6570\u5B57\u548C\u7279\u6B8A\u5B57\u7B26\u4E2D\u76842\u79CD\u7C7B\u578B\uFF0C\u957F\u5EA6\u4E0D\u5C0F\u4E8E{}\u4F4D = password must contain two types of upper and lower case letters, numbers, special characters, and length shall not be less than {} digits
\u5E94\u7528\u5DF2\u88AB\u505C\u7528 = App has been disabled
\u5BC6\u7801\u4E0D\u80FD\u4E3A\u7A7A = Password can not be null
\u5BC6\u7801\u9700\u8981\u5305\u542B\u5C0F\u5199\u5B57\u6BCD\uFF0C\u957F\u5EA6\u4E0D\u5C0F\u4E8E{}\u4F4D = The password should contains lower case letters and length shall not be less than {} digits
\u5BC6\u7801\u9700\u8981\u5305\u542B\u5927\u5199\u5B57\u6BCD\uFF0C\u957F\u5EA6\u4E0D\u5C0F\u4E8E{}\u4F4D = The password should contains upper case letters and length shall not be less than {} digits
\u5BC6\u7801\u9700\u8981\u5305\u542B\u7279\u6B8A\u5B57\u7B26\uFF0C\u957F\u5EA6\u4E0D\u5C0F\u4E8E{}\u4F4D = The password should contains special character and length shall not be less than {} digits
\u5BC6\u7801\u9700\u8981\u5305\u542B\u6570\u5B57\uFF0C\u957F\u5EA6\u4E0D\u5C0F\u4E8E{}\u4F4D = The password should contains number and length shall not be less than {} digits
\u627E\u4E0D\u5230\u79DF\u6237 = Tenant not found
\u60A8\u8F93\u5165\u7684\u624B\u673A\u53F7\u5DF2\u7ED1\u5B9A = The mobile number you entered has been bound
\u60A8\u8F93\u5165\u7684\u90AE\u7BB1\u53F7\u5DF2\u7ED1\u5B9A = The email number you entered has been bound